In [1]:
# Importing the libraries
import sqlite3
import random

In [2]:
%load_ext sql

# Building the database for this lab (lab4.db3).

In [3]:
#Creating and connecting to a sqlite database
sqlite3.connect("lab4.db3")

In [4]:
# Connecting to a sqlite database
%sql sqlite:///lab4.db3

# Q01. A is a superkey for a relation T (A, B, C, D)

#### Writting SQL statements to create the two tables "T" and insert the data. One table has the name Thold and the other is called TNOThold

In [5]:
%%sql 
DROP TABLE IF EXISTS Thold;
DROP TABLE IF EXISTS TNOThold;

CREATE TABLE Thold(A CHAR(10), B CHAR(20), C CHAR(20), D CHAR(20));
CREATE TABLE TNOThold(A CHAR(10), B CHAR(20), C CHAR(20), D CHAR(20));


INSERT INTO Thold values(1,'Ricardo Cezar',10,35);
INSERT INTO Thold values(2,'Kendrick Lamar',9,25);
INSERT INTO Thold values(3,'Piau Abul',5,42);
INSERT INTO Thold values(4,'Maria Paku',6,41);
INSERT INTO Thold values(5,'Carla Dalanese',2,23);


INSERT INTO TNOThold values(1,'Ricardo Cezar',10,35);
INSERT INTO TNOThold values(1,'Ricardo Cezar',4345,2989);
INSERT INTO TNOThold values(3,'Piau Abul',6,42);
INSERT INTO TNOThold values(3,'George Bei',535,873);
INSERT INTO TNOThold values(5,'Carla Dalanese',2,23);

 * sqlite:///lab4.db3
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q01. Table where the condition holds (A is a superkey for the relation ABCD).

In [6]:
%%sql
/* Here we can check that the result is an empty table, hence attribute A is a superkey of the table */
SELECT DISTINCT t.A
FROM Thold as t
WHERE t.B NOT IN (
    SELECT B
    FROM Thold
    GROUP BY A) 
OR t.C NOT IN (
    SELECT C
    FROM Thold
    GROUP BY A)
OR t.D NOT IN (
    SELECT D
    FROM Thold
    GROUP BY A
    )
GROUP BY A;

 * sqlite:///lab4.db3
Done.

[]

#### Q01. Table where the condition DOES NOT hold (A is NOT a superkey for the relation ABCD).

In [7]:
%%sql
/* Here we can check that there are some repetitive "A" attributes (A=1,A=3) for tuples that are not equal, hence A is NOT a superkey */
SELECT DISTINCT t.A
FROM TNOThold as t
WHERE t.B NOT IN (
    SELECT B
    FROM TNOThold
    GROUP BY A) 
OR t.C NOT IN (
    SELECT C
    FROM TNOThold
    GROUP BY A)
OR t.D NOT IN (
    SELECT D
    FROM TNOThold
    GROUP BY A
    )
GROUP BY A;

 * sqlite:///lab4.db3
Done.

[('1',), ('3',)]

# Q02. The combinations of two attributes - (A,B) (B,C) - in the relation T (A, B, C, D) are each keys.

In [8]:
%%sql 
/* Dropping the previous tables and creating new tables "T" for this question*/
DROP TABLE IF EXISTS Thold;
DROP TABLE IF EXISTS TNOThold;

CREATE TABLE Thold(A CHAR(10), B CHAR(20), C CHAR(20), D CHAR(20));
CREATE TABLE TNOThold(A CHAR(10), B CHAR(20), C CHAR(20), D CHAR(20));

INSERT INTO Thold values(1,'Ricardo','Brazil','Sao Paulo');
INSERT INTO Thold values(1,'Carl','USA','New York');
INSERT INTO Thold values(2,'Ricardo','Mexico','Tihuana');
INSERT INTO Thold values(2,'Maria','Spain','Madrid');
INSERT INTO Thold values(5,'Maria','Italy','Rome');

INSERT INTO TNOThold values(1,'Ricardo','Brazil','Sao Paulo');
INSERT INTO TNOThold values(1,'Ricardo','Brazil','Rio De Janeiro');
INSERT INTO TNOThold values(2,'Maria','Spain','Madrid');
INSERT INTO TNOThold values(2,'Maria','Spain','Barcelona');
INSERT INTO TNOThold values(5,'Carla','Italy','Rome');

 * sqlite:///lab4.db3
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q02. Table where the condition holds: (A,B) combination.

In [9]:
%%sql
/* Whe can check that the result is an empty instance of the table. */
SELECT DISTINCT t1.A, t1.B, t1.C, t1.D
FROM Thold t1
WHERE t1.C NOT IN(
    SELECT DISTINCT t2.C
    FROM Thold as t2
    GROUP BY A,B) 
OR t1.D NOT IN(
    SELECT DISTINCT t3.D
    FROM Thold as t3
    GROUP BY A,B)

 * sqlite:///lab4.db3
Done.

[]

#### Q02. Table where the condition DOES NOT hold: (A,B) combination.

In [10]:
%%sql
/* Whe can check that the result shows some tuples of the table. */
SELECT DISTINCT t1.A, t1.B, t1.C, t1.D
FROM TNOThold t1
WHERE t1.C NOT IN(
    SELECT DISTINCT t2.C
    FROM TNOThold as t2
    GROUP BY A,B) 
OR t1.D NOT IN(
    SELECT DISTINCT t3.D
    FROM TNOThold as t3
    GROUP BY A,B)

 * sqlite:///lab4.db3
Done.

[('1', 'Ricardo', 'Brazil', 'Rio De Janeiro'),
 ('2', 'Maria', 'Spain', 'Barcelona')]

#### Q02. Table where the condition holds: (B,C) combination.

In [11]:
%%sql
/* Whe can check that the result is an empty instance of the table. */
SELECT DISTINCT t1.A, t1.B, t1.C, t1.D
FROM Thold t1
WHERE t1.A NOT IN(
    SELECT DISTINCT t2.A
    FROM Thold as t2
    GROUP BY B,C) 
OR t1.D NOT IN(
    SELECT DISTINCT t3.D
    FROM Thold as t3
    GROUP BY B,C)

 * sqlite:///lab4.db3
Done.

[]

#### Q02. Table where the condition DOES NOT hold: (B,C) combination.

In [12]:
%%sql
/* Whe can check that the result shows some tuples of the table. */
SELECT DISTINCT t1.A, t1.B, t1.C, t1.D
FROM TNOThold t1
WHERE t1.A NOT IN(
    SELECT DISTINCT t2.A
    FROM TNOThold as t2
    GROUP BY B,C) 
OR t1.D NOT IN(
    SELECT DISTINCT t3.D
    FROM TNOThold as t3
    GROUP BY B,C)

 * sqlite:///lab4.db3
Done.

[('1', 'Ricardo', 'Brazil', 'Rio De Janeiro'),
 ('2', 'Maria', 'Spain', 'Barcelona')]

# Q03. TGD in Sailors and Reserves

In [13]:
%%sql 
DROP TABLE IF EXISTS Sailors;
DROP TABLE IF EXISTS Boats;
DROP TABLE IF EXISTS Reserves;

CREATE TABLE Sailors(sid CHAR(10), sname CHAR(20), rating INTEGER, age INTEGER,PRIMARY KEY(sid));
CREATE TABLE Boats(bid CHAR(10), name CHAR(20), color CHAR(20), PRIMARY KEY(bid));
CREATE TABLE Reserves(sid CHAR(10), bid CHAR(10),sname CHAR(30),bname CHAR(30), date TEXT, 
                      FOREIGN KEY(sid) REFERENCES Sailors(sid),
                      FOREIGN KEY(bid) REFERENCES boats(bid));

INSERT INTO Sailors values(1,'Ricardo Cezar',10,35);
INSERT INTO Sailors values(2,'Kendrick Lamar',9,25);
INSERT INTO Sailors values(3,'Piau Abul',5,42);
INSERT INTO Sailors values(4,'Maria Paku',6,41);
INSERT INTO Sailors values(5,'Carla Dalanese',2,23);

INSERT INTO Reserves values(1,110,'Ricardo Cezar','Pearl','3/21/2018');
INSERT INTO Reserves values(2,110,'Kendrick Lamar','Gift Ocean','5/16/2019');
INSERT INTO Reserves values(3,110,'Piau Abul','Gift Ocean','2/1/2021');
INSERT INTO Reserves values(4,111,'Maria Paku','Marvelous','7/1/2021');
INSERT INTO Reserves values(5,112,'Carla Dalanese','Pearl','9/13/2020');

 * sqlite:///lab4.db3
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q03. Table where the condition holds: TGD between Sailors and Reserves.

In [14]:
%%sql 
SELECT DISTINCT s.sid, s.sname
FROM Sailors s, Reserves r
WHERE s.sid NOT IN(
    SELECT DISTINCT r2.sid
    FROM Reserves r2
)

 * sqlite:///lab4.db3
Done.

[]

#### Q03. Table where the condition DOES NOT hold: TGD between Sailors and Reserves.

In [15]:
%%sql 
DROP TABLE IF EXISTS Sailors;
DROP TABLE IF EXISTS Boats;
DROP TABLE IF EXISTS Reserves;

CREATE TABLE Sailors(sid CHAR(10), sname CHAR(20), rating INTEGER, age INTEGER,PRIMARY KEY(sid));
CREATE TABLE Boats(bid CHAR(10), name CHAR(20), color CHAR(20), PRIMARY KEY(bid));
CREATE TABLE Reserves(sid CHAR(10), bid CHAR(10),sname CHAR(30),bname CHAR(30), date TEXT, 
                      FOREIGN KEY(sid) REFERENCES Sailors(sid),
                      FOREIGN KEY(bid) REFERENCES boats(bid));

INSERT INTO Sailors values(1,'Ricardo Cezar',10,35);
INSERT INTO Sailors values(2,'Kendrick Lamar',9,25);
INSERT INTO Sailors values(3,'Piau Abul',5,42);
INSERT INTO Sailors values(4,'Maria Paku',6,41);
INSERT INTO Sailors values(5,'Carla Dalanese',2,23);
INSERT INTO Sailors values(6,'Kendrick Lamar',52,87);

INSERT INTO Reserves values(1,110,'Ricardo Cezar','Pearl','3/21/2018');
INSERT INTO Reserves values(2,110,'Kendrick Lamar','Gift Ocean','5/16/2019');
INSERT INTO Reserves values(3,110,'Piau Abul','Gift Ocean','2/1/2021');
INSERT INTO Reserves values(4,111,'Maria Paku','Marvelous','7/1/2021');
INSERT INTO Reserves values(5,112,'Carla Dalanese','Pearl','9/13/2020');

 * sqlite:///lab4.db3
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%%sql 
SELECT DISTINCT s.sid, s.sname
FROM Sailors s, Reserves r
WHERE s.sid NOT IN(
    SELECT DISTINCT r2.sid
    FROM Reserves r2
)

 * sqlite:///lab4.db3
Done.

[('6', 'Kendrick Lamar')]

# Q04. Multivalued Dependency (MVD): assume R = (A, B, C, D E), X = (A, B, C), Y = (C, D, E)

#### Q04. Table where the condition holds: MVD between t1,t2 and t3.

In [17]:
%%sql 
DROP TABLE IF EXISTS R;
DROP TABLE IF EXISTS X;
DROP TABLE IF EXISTS Y;

CREATE TABLE R(A CHAR(10), B CHAR(20), C CHAR(20), D CHAR(20),E char(20));
CREATE TABLE X(A CHAR(10), B CHAR(20), C CHAR(20));
CREATE TABLE Y(C CHAR(10), D CHAR(20), E CHAR(20));

INSERT INTO R values(1,11,21,31,41);
INSERT INTO R values(1,11,21,31,41);
INSERT INTO R values(1,11,21,31,41);
INSERT INTO R values(4,14,24,34,44);
INSERT INTO R values(5,15,25,35,45);

INSERT INTO X values(1,11,21);
INSERT INTO X values(1,11,21);
INSERT INTO X values(1,11,21);
INSERT INTO X values(4,14,24);
INSERT INTO X values(5,15,25);

INSERT INTO Y values(21,31,41);
INSERT INTO Y values(21,31,41);
INSERT INTO Y values(21,31,41);
INSERT INTO Y values(24,34,44);
INSERT INTO Y values(25,35,45);

 * sqlite:///lab4.db3
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [18]:
%%sql
SELECT x.C, COUNT(x.A) as countA
FROM X x
GROUP BY x.A
HAVING countA > 1

 * sqlite:///lab4.db3
Done.

[('21', 3)]

#### Q04. Table where the condition DOES NOT hold: MVD between t1,t2 and t3.

In [19]:
%%sql 
DROP TABLE IF EXISTS R;
DROP TABLE IF EXISTS X;
DROP TABLE IF EXISTS Y;

CREATE TABLE R(A CHAR(10), B CHAR(20), C CHAR(20), D CHAR(20),E char(20));
CREATE TABLE X(A CHAR(10), B CHAR(20), C CHAR(20));
CREATE TABLE Y(C CHAR(10), D CHAR(20), E CHAR(20));

INSERT INTO R values(1,11,21,31,41);
INSERT INTO R values(1,11,21,32,42);
INSERT INTO R values(1,11,21,33,43);
INSERT INTO R values(4,14,24,34,44);
INSERT INTO R values(5,15,25,35,45);

INSERT INTO X values(1,11,21);
INSERT INTO X values(1,11,21);
INSERT INTO X values(1,11,21);
INSERT INTO X values(4,14,24);
INSERT INTO X values(5,15,25);

INSERT INTO Y values(21,31,41);
INSERT INTO Y values(21,32,42);
INSERT INTO Y values(21,33,43);
INSERT INTO Y values(24,34,44);
INSERT INTO Y values(25,35,45);

 * sqlite:///lab4.db3
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]